package com.teemo.wheelview.common;


public class ConstantUtils {
    private static ConstantUtils sInstance;

    public static ConstantUtils getInstance () {
        if (sInstance == null) {
            sInstance = new ConstantUtils();
        }
        return sInstance;
    }

    public static class KeyList {

        public static final String[] SCENE_TIME_YEAR_ARRY = 
            {"2000年", "2001年", "2002年", "2003年", "2004年", "2005年", "2006年", "2007年", "2008年", "2009年", "2010年", "2011年", "2012年", "2013年", "2014年", "2015年"
            , "2016年", "2017年", "2018年", "2019年", "2020年"};

        public static final String[] SCENE_TIME_MONTH_ARRY = 
            {"1月", "2月", "3月", "4月", "5月", "6月", "7月", "8月", "9月", "10月", "11月", "12月"};

        public static final String[] SCENE_TIME_DAY_ARRY = 
            {"1日", "2日", "3日", "4日", "5日", "6日", "7日", "8日", "9日", "10日"
            , "11日", "12日", "13日", "14日", "15日", "16日", "17日", "18日", "19日", "20日"
            , "21日", "22日", "23日", "24日", "25日", "26日", "27日", "28日", "29日", "30日","31日"};

        public static final String[] SCENE_TIME_HOUR_ARRY = 
            {"00", "01", "02", "03", "04", "05", "06", "07", "08", "09",
            "10", "11", "12", "13", "14", "15","16", "17", "18", "19",
            "20", "21", "22", "23"};

        public static final String[] SCENE_TIME_MINUTE_ARRY =
            {"00", "01", "02", "03", "04", "05", "06", "07", "08", "09",
            "10", "11", "12", "13", "14", "15", "16", "17", "18", "19",
            "20", "21", "22", "23", "24", "25", "26", "27", "28", "29",
            "30", "31", "32", "33", "34", "35", "36", "37", "38", "39",
            "40", "41", "42", "43", "44", "45", "46", "47", "48", "49",
            "50", "51", "52", "53", "54", "55", "56", "57", "58", "59"};

        public String[] names = {"北  京", "天  津", "河  北", "山  西", "内蒙古", "辽  宁", "吉  林", "黑龙江", "上  海", "江  苏",
                "浙  江", "安  徽", "福  建", "江  西", "山  东", "河  南", "湖  北", "湖  南", "广  东", "广  西",
                "海  南", "重  庆", "四  川", "贵  州", "云  南", "西  藏", "陕  西", "甘  肃", "青  海", "宁  夏",
                "新  疆"};
    }


}
